app/controllers/activities_controller.rb

SELECT "activities".* FROM "activities" WHERE "activities"."user_id" = $1 AND "activities"."customdate" = $2  [["user_id", 1], ["customdate", Sat, 25 Mar 2017]]
---
  def new
    @activity = current_user.activities.build
    @activities = current_user.activities.where(customdate: params[:customdate])

INSERT INTO "activities" ("name", "exertion", "created_at", "updated_at", "user_id", "customdate") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "hsddfhdskfhs"], ["exertion", 2], ["created_at", 2017-03-23 09:46:49 UTC], ["updated_at", 2017-03-23 09:46:49 UTC], ["user_id", 1], ["customdate", Sat, 25 Mar 2017]]
---
  def create
    @activity = current_user.activities.build(activity_params)
    if @activity.save

SELECT  "activities".* FROM "activities" WHERE "activities"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "activities" WHERE "activities"."id" = $1  [["id", 3]]
---
  def destroy
    @activity = Activity.find(params[:id])
    @activity.destroy