app/controllers/foodlogs_controller.rb

SELECT "foodlogs".* FROM "foodlogs" WHERE "foodlogs"."user_id" = $1 AND "foodlogs"."customdate" = $2  [["user_id", 1], ["customdate", Sat, 25 Mar 2017]]
---
  def new
    @foodlog = current_user.foodlogs.build
    @foodlogs = current_user.foodlogs.where(customdate: params[:customdate])

INSERT INTO "foodlogs" ("food", "created_at", "updated_at", "customdate", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["food", "jkfhdsjkfhjksdfs"], ["created_at", 2017-03-23 09:46:05 UTC], ["updated_at", 2017-03-23 09:46:05 UTC], ["customdate", Sat, 25 Mar 2017], ["user_id", 1]]
---
  def create
    @foodlog = current_user.foodlogs.build(foodlog_params)
    if @foodlog.save

SELECT  "foodlogs".* FROM "foodlogs" WHERE "foodlogs"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
DELETE FROM "foodlogs" WHERE "foodlogs"."id" = $1  [["id", 6]]
---
  def destroy
    @foodlog = Foodlog.find(params[:id])
    @foodlog.delete