app/controllers/pain_activity_controller.rb

SELECT "activities".* FROM "activities"
SELECT "painscores".* FROM "painscores"
---
  def index
    @activities = Activity.all
    @painscores = Painscore.all