app/controllers/painscores_controller.rb

  def new
    @painscore = current_user.painscores.build
    @painscores = current_user.painscores.where(customdate: params[:customdate])
---
SELECT "painscores".* FROM "painscores" WHERE "painscores"."user_id" = $1 AND "painscores"."customdate" = $2  [["user_id", 1], ["customdate", Thu, 23 Mar 2017]]

  def create
    @painscore = current_user.painscores.build(painscore_params)
    if @painscore.save
---
INSERT INTO "painscores" ("score", "created_at", "updated_at", "customdate", "user_id", "notes") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["score", 10], ["created_at", 2017-03-23 09:44:42 UTC], ["updated_at", 2017-03-23 09:44:42 UTC], ["customdate", Thu, 23 Mar 2017], ["user_id", 1], ["notes", ""]]

  def destroy
    @painscore = Painscore.find(params[:id])
    @painscore.delete
---
SELECT  "painscores".* FROM "painscores" WHERE "painscores"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
DELETE FROM "painscores" WHERE "painscores"."id" = $1  [["id", 11]]